In [1]:
!unzip ./archive\ \(54\).zip

Archive:  ./archive (54).zip
  inflating: city_temperature.csv

In [2]:
import pandas as pd
data = pd.read_csv('./city_temperature.csv')

/home/ranuga/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3146: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [3]:
data.head()

   Region  Country State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995            47.9

In [4]:
data.isna().sum()

Region                  0
Country                 0
State             1450990
City                    0
Month                   0
Day                     0
Year                    0
AvgTemperature          0
dtype: int64

In [5]:
del data['State']

In [6]:
data.isna().sum()

Region            0
Country           0
City              0
Month             0
Day               0
Year              0
AvgTemperature    0
dtype: int64

In [7]:
data.dtypes

Region             object
Country            object
City               object
Month               int64
Day                 int64
Year                int64
AvgTemperature    float64
dtype: object

In [8]:
data.head()

   Region  Country     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria  Algiers      1    1  1995            64.2
1  Africa  Algeria  Algiers      1    2  1995            49.4
2  Africa  Algeria  Algiers      1    3  1995            48.8
3  Africa  Algeria  Algiers      1    4  1995            46.4
4  Africa  Algeria  Algiers      1    5  1995            47.9

In [9]:
def object_to_int(data,coloum):
    index = -1
    info_dict = {}
    all_info = []
    for i in data[coloum]:
        if i not in info_dict:
            index = index + 1
            info_dict[i] = index
    for x in data[coloum]:
        all_info.append(info_dict[x])
    return all_info,info_dict

In [11]:
data.head()

      City  Month  Day  Year  AvgTemperature
0  Algiers      1    1  1995            64.2
1  Algiers      1    2  1995            49.4
2  Algiers      1    3  1995            48.8
3  Algiers      1    4  1995            46.4
4  Algiers      1    5  1995            47.9

In [12]:
info = object_to_int(data,'City')
with open('./city.json','w') as json_file:
    import json
    json.dump(info[1],json_file)
data['City'] = info[0]

In [13]:
data.head()

   City  Month  Day  Year  AvgTemperature
0     0      1    1  1995            64.2
1     0      1    2  1995            49.4
2     0      1    3  1995            48.8
3     0      1    4  1995            46.4
4     0      1    5  1995            47.9

In [14]:
data.tail()

         City  Month  Day  Year  AvgTemperature
2906322   320      7   27  2013            82.4
2906323   320      7   28  2013            81.6
2906324   320      7   29  2013            84.2
2906325   320      7   30  2013            83.8
2906326   320      7   31  2013            83.6

In [15]:
!ls

'archive (54).zip'   city.json	 city_temperature.csv   main.ipynb

In [16]:
X = data.drop('AvgTemperature',axis=1)

In [17]:
y = data['AvgTemperature']

In [18]:
from sklearn.model_selection import *
from sklearn.metrics import *
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.25)

In [20]:
from sklearn.ensemble import *
from sklearn.tree import *

In [22]:
model = DecisionTreeRegressor()
model.fit(X_train,y_train)
model.score(X_test,y_test)

0.5619647632688287

In [24]:
import pickle
pickle.dump(model,open('./model.pkl','wb'))